print("Введите значение координатов x1 y1 вершины A через пробел")
x1, y1 = map(int, input().split())
print("Введите значение координатов x2 y2 вершины B через пробел")
x2, y2 = map(int, input().split())
print("Введите значение координатов x3 y3 вершины C через пробел")
x3, y3 = map(int, input().split())
ab=((x1-x2)**2+(y1-y2)**2)**0.5
bc=((x2-x3)**2+(y2-y3)**2)**0.5
ac=((x1-x3)**2+(y1-y3)**2)**0.5
p=ab+bc+ac
pp=(ab+bc+ac)/2
s=(pp*(pp-ab)*(pp-bc)*(pp-ac))**0.5
print("Периметр треугольника равен", '%.3f'%p)
print("Площадь треугольника равна", '%.3f'%s)
