s=["Сто", "Двести", "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот"]
d=[" двадцать", " тридцать", " сорок", " пятьдесят", " шестьдесят", " семьдесят", " восемьдесят", " девяносто"]
d1=[" десять", " одиннадцать", " двенадцать", " тринадцать", " четырнадцать", " пятнадцать", " шестнадцать", " семнадцать", " восемнадцать", " девятнадцать"]
e=[" один", " два", " три", " четыре", " пять", " шесть", " семь", " восемь", " девять"]
print("Введите число от 100 до 999")
a=int(input())
if a<100 or a >999:
    print("Введено неверное число")
elif 0<a%100<10:
    print(s[(a//100)-1] + e[(a% 10) - 1])
elif 10 <= a % 100 < 20:
    print(s[(a // 100) - 1] + d1[(a % 100) - 10])
elif a % 100 >= 20 and a % 10 == 0:
    print(s[(a // 100) - 1] + d[((a % 100) // 10) - 2])
elif a % 100 >= 20 and a % 10 > 0:
    print(s[(a // 100) - 1] + d[((a % 100) // 10) - 2] + e[(a % 10) - 1])
